<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of gopass and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.wholtz.gopass.munki</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>gopass</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>gopass is a command line based password manager created with teams in mind</string>
            <key>developer</key>
            <string>Just Watch</string>
            <key>display_name</key>
            <string>gopass</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>requires</key>
            <array>
                    <string>GPGSuite</string>
                    <!-- also requires git or xcode command line tools -->
            </array>
            <key>postinstall_script</key>
            <string>#!/bin/sh

# symlink gopass to pass for compatibility with pass utilities
ln -s /usr/local/bin/gopass /usr/local/bin/pass

           </string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.wholtz.gopass.pkg</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>version_comparison_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
