<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
   <key>Description</key>
   <string>Downloads the latest gopass tar.gz archive</string>
   <key>Identifier</key>
   <string>com.github.wholtz.gopass.download</string>
   <key>Input</key>
   <dict>
      <key>NAME</key>
      <string>gopass</string>
   </dict>
   <key>MinimumVersion</key>
   <string>0.5.0</string>
   <key>Process</key>
   <array>
      <dict>
          <key>Processor</key>
          <string>GitHubReleasesInfoProvider</string>
          <key>Arguments</key>
          <dict>
              <key>github_repo</key>
              <string>gopasspw/gopass</string>
          </dict>
      </dict>
      <dict>
         <key>Processor</key>
         <string>URLDownloader</string>
         <key>Arguments</key>
         <dict>
            <key>url</key>
            <string>https://github.com/gopasspw/gopass/releases/download/v%version%/gopass-%version%-darwin-amd64.tar.gz</string>
            <key>filename</key>
            <string>%NAME%-%version%.tar.gz</string>
         </dict>
      </dict>
   </array>
</dict>
</plist>
