<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of ChemDoodle.
    
Valid values for ARCH include:
- "x64" (default, Intel)
- "aarch64" (Apple Silicon)
</string>
    <key>Identifier</key>
    <string>com.github.wholtz.chemdoodle.download</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ChemDoodle</string>
        <key>ARCH</key>
        <string>x64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.chemdoodle.com/download/</string>
                <key>re_pattern</key>
                <string>ChemDoodle-macos-%ARCH%-(?P&lt;raw_version&gt;[0-9\.\-]+)\.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.chemdoodle.com/downloads/ChemDoodle-macos-%ARCH%-%raw_version%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/ChemDoodle/ChemDoodle.app</string>
                <key>requirement</key>
                <string>identifier "com.iChemLabs.ChemDoodle" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "9XP397UW95"</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
