<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of ChemDoodle and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.wholtz.chemdoodle.munki</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>ChemDoodle</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Chemical drawing application that pastes scalable vector graphics and provides round trip editing into Microsoft Office, iWork and OpenOffice (among others), and can read and write all of our competitors’ formats.</string>
			<key>developer</key>
			<string>iChemLabs</string>
			<key>display_name</key>
			<string>ChemDoodle</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.wholtz.chemdoodle.download</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%pathname%</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/ChemDoodle/ChemDoodle.app</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>items_to_copy</key>
					<array>
						<dict>
							<key>destination_path</key>
							<string>/Applications</string>
							<key>source_item</key>
							<string>ChemDoodle</string>
						</dict>
					</array>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--itemname=ChemDoodle/ChemDoodle.app</string>
					<string>--destinationpath=/Applications/ChemDoodle</string>
				</array>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
